yangliangquan/ChibiOS/os/hal/ports/CH32/LLD/SDIOv1/hal_sdc_lld.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    SDIOv1/hal_sdc_lld.h
 * @brief   CH32 SDC subsystem low level driver header (SDIO peripheral).
 *
 * @addtogroup SDC
 * @{
 */

#ifndef HAL_SDC_LLD_H
#define HAL_SDC_LLD_H

#if HAL_USE_SDC || defined(__DOXYGEN__)

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   SDC1 driver enable switch.
 * @details If set to @p TRUE the support for SDC1 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(CH32_SDC_USE_SDC1) || defined(__DOXYGEN__)
#define CH32_SDC_USE_SDC1                   FALSE
#endif

/**
 * @brief   Write timeout in milliseconds.
 */
#if !defined(CH32_SDC_WRITE_TIMEOUT) || defined(__DOXYGEN__)
#define CH32_SDC_WRITE_TIMEOUT              10000
#endif

/**
 * @brief   Read timeout in milliseconds.
 */
#if !defined(CH32_SDC_READ_TIMEOUT) || defined(__DOXYGEN__)
#define CH32_SDC_READ_TIMEOUT               10000
#endif

/**
 * @brief   Card clock activation delay in milliseconds.
 */
#if !defined(CH32_SDC_CLOCK_DELAY) || defined(__DOXYGEN__)
#define CH32_SDC_CLOCK_DELAY                10
#endif

/**
 * @brief   Support for unaligned transfers.
 * @note    Unaligned transfers are much slower because a bounce buffer
 *          is used.
 */
#if !defined(CH32_SDC_UNALIGNED_SUPPORT) || defined(__DOXYGEN__)
#define CH32_SDC_UNALIGNED_SUPPORT          TRUE
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of card flags.
 */
typedef uint32_t sdcmode_t;

/**
 * @brief   SDC Driver condition flags type.
 */
typedef uint32_t sdcflags_t;

/**
 * @brief   Type of a structure representing an SDC driver.
 */
typedef struct SDCDriver SDCDriver;

/**
 * @brief   Driver configuration structure.
 */
typedef struct {
  /**
   * @brief   Bus width.
   */
  sdcbusmode_t  bus_width;
  /* End of the mandatory fields.*/
} SDCConfig;

/**
 * @brief   @p SDCDriver specific methods.
 */
#define _sdc_driver_methods                                                 \
  _mmcsd_block_device_methods

/**
 * @extends MMCSDBlockDeviceVMT
 *
 * @brief   @p SDCDriver virtual methods table.
 */
struct SDCDriverVMT {
  _sdc_driver_methods
};

/**
 * @brief   Structure representing an SDC driver.
 */
struct SDCDriver {
  /**
   * @brief Virtual Methods Table.
   */
  const struct SDCDriverVMT *vmt;
  _mmcsd_block_device_data
  /**
   * @brief Current configuration data.
   */
  const SDCConfig            *config;
  /**
   * @brief Various flags regarding the mounted card.
   */
  sdcmode_t                  cardmode;
  /**
   * @brief Errors flags.
   */
  sdcflags_t                 errors;
  /**
   * @brief Card RCA.
   */
  uint32_t                   rca;
  /**
   * @brief   Pointer to the SDIO registers block.
   */
  SDIO_TypeDef               *sdio;
  /**
   * @brief   SDIO peripheral clock frequency.
   */
  uint32_t                   clkfreq;
  /**
   * @brief   Transaction thread reference, used in I-class APIs.
   */
  thread_reference_t         thread;
  /**
   * @brief   Buffer for internal operations (bounce buffer).
   */
  uint8_t                    *buf;
  /**
   * @brief   Word buffer for response polling of internal operations.
   */
  uint32_t                   *resp;
  /* End of the mandatory fields.*/
};

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#if (CH32_SDC_USE_SDC1 == TRUE) && !defined(__DOXYGEN__)
extern SDCDriver SDCD1;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void sdc_lld_init(void);
  void sdc_lld_start(SDCDriver *sdcp);
  void sdc_lld_stop(SDCDriver *sdcp);
  void sdc_lld_start_clk(SDCDriver *sdcp);
  void sdc_lld_set_data_clk(SDCDriver *sdcp, sdcbusclk_t clk);
  void sdc_lld_stop_clk(SDCDriver *sdcp);
  void sdc_lld_set_bus_mode(SDCDriver *sdcp, sdcbusmode_t mode);
  void sdc_lld_send_cmd_none(SDCDriver *sdcp, uint8_t cmd, uint32_t arg);
  bool sdc_lld_send_cmd_short(SDCDriver *sdcp, uint8_t cmd, uint32_t arg,
                              uint32_t *resp);
  bool sdc_lld_send_cmd_short_crc(SDCDriver *sdcp, uint8_t cmd, uint32_t arg,
                                  uint32_t *resp);
  bool sdc_lld_send_cmd_long_crc(SDCDriver *sdcp, uint8_t cmd, uint32_t arg,
                                 uint32_t *resp);
  bool sdc_lld_read_special(SDCDriver *sdcp, uint8_t *buf, size_t bytes,
                            uint8_t cmd, uint32_t argument);
  bool sdc_lld_read(SDCDriver *sdcp, uint32_t startblk,
                    uint8_t *buf, uint32_t n);
  bool sdc_lld_write(SDCDriver *sdcp, uint32_t startblk,
                     const uint8_t *buf, uint32_t n);
  bool sdc_lld_sync(SDCDriver *sdcp);
  bool sdc_lld_is_card_inserted(SDCDriver *sdcp);
  bool sdc_lld_is_write_protected(SDCDriver *sdcp);
#ifdef __cplusplus
}
#endif

#endif /* HAL_USE_SDC */

#endif /* HAL_SDC_LLD_H */

/** @} */
